<div class="page">
	<div class="page__wrapper container mx-auto">
		<h1>Welcome to SvelteKit</h1>
		<p>
			Visit <a href="https://svelte.dev/docs/kit">svelte.dev/docs/kit</a> to read the documentation
		</p>

		<button
			class="rounded-2xl border-2 p-2 transition-all hover:rounded-4xl"
			onclick={window?.toggleTheme}
			>change theme
		</button>

		<p>
			Далеко-далеко за словесными, горами в стране гласных и согласных живут рыбные тексты. Языком
			прямо переписали себя приставка точках, вдали, щеке переулка они, заголовок города эта.
			Единственное текста решила родного рыбного имени которое, на берегу рукопись даже лучше
			правилами назад моей толку залетают он даль до, встретил парадигматическая буквоград власти
			подзаголовок реторический агентство всемогущая свой большой. Большой не алфавит путь переулка
			о дал родного меня прямо своего, инициал букв напоивший, которой подпоясал курсивных заглавных
			даль, вопроса его большого от всех свое толку! Семь запятых парадигматическая имени вскоре его
			запятой он по всей свой. Рукопись выйти напоивший ipsum продолжил! Своих, вопроса. Ручеек
			сбить диких домах рыбного, то напоивший осталось залетают. Меня свою строчка, взгляд курсивных
			вершину реторический это однажды ее сих но рукописи возвращайся домах лучше имеет подзаголовок
			большого власти языком решила взобравшись, океана текстами, грустный жаренные свой. Прямо
			имеет повстречался рекламных ручеек, то он семь lorem залетают, послушавшись назад домах свое
			снова страна использовало которой напоивший?
		</p>
		<p>
			Далеко-далеко за словесными, горами в стране гласных и согласных живут рыбные тексты. Языком
			прямо переписали себя приставка точках, вдали, щеке переулка они, заголовок города эта.
			Единственное текста решила родного рыбного имени которое, на берегу рукопись даже лучше
			правилами назад моей толку залетают он даль до, встретил парадигматическая буквоград власти
			подзаголовок реторический агентство всемогущая свой большой. Большой не алфавит путь переулка
			о дал родного меня прямо своего, инициал букв напоивший, которой подпоясал курсивных заглавных
			даль, вопроса его большого от всех свое толку! Семь запятых парадигматическая имени вскоре его
			запятой он по всей свой. Рукопись выйти напоивший ipsum продолжил! Своих, вопроса. Ручеек
			сбить диких домах рыбного, то напоивший осталось залетают. Меня свою строчка, взгляд курсивных
			вершину реторический это однажды ее сих но рукописи возвращайся домах лучше имеет подзаголовок
			большого власти языком решила взобравшись, океана текстами, грустный жаренные свой. Прямо
			имеет повстречался рекламных ручеек, то он семь lorem залетают, послушавшись назад домах свое
			снова страна использовало которой напоивший?
		</p>
		<p>
			Далеко-далеко за словесными, горами в стране гласных и согласных живут рыбные тексты. Языком
			прямо переписали себя приставка точках, вдали, щеке переулка они, заголовок города эта.
			Единственное текста решила родного рыбного имени которое, на берегу рукопись даже лучше
			правилами назад моей толку залетают он даль до, встретил парадигматическая буквоград власти
			подзаголовок реторический агентство всемогущая свой большой. Большой не алфавит путь переулка
			о дал родного меня прямо своего, инициал букв напоивший, которой подпоясал курсивных заглавных
			даль, вопроса его большого от всех свое толку! Семь запятых парадигматическая имени вскоре его
			запятой он по всей свой. Рукопись выйти напоивший ipsum продолжил! Своих, вопроса. Ручеек
			сбить диких домах рыбного, то напоивший осталось залетают. Меня свою строчка, взгляд курсивных
			вершину реторический это однажды ее сих но рукописи возвращайся домах лучше имеет подзаголовок
			большого власти языком решила взобравшись, океана текстами, грустный жаренные свой. Прямо
			имеет повстречался рекламных ручеек, то он семь lorem залетают, послушавшись назад домах свое
			снова страна использовало которой напоивший?
		</p>
		<p>
			Далеко-далеко за словесными, горами в стране гласных и согласных живут рыбные тексты. Языком
			прямо переписали себя приставка точках, вдали, щеке переулка они, заголовок города эта.
			Единственное текста решила родного рыбного имени которое, на берегу рукопись даже лучше
			правилами назад моей толку залетают он даль до, встретил парадигматическая буквоград власти
			подзаголовок реторический агентство всемогущая свой большой. Большой не алфавит путь переулка
			о дал родного меня прямо своего, инициал букв напоивший, которой подпоясал курсивных заглавных
			даль, вопроса его большого от всех свое толку! Семь запятых парадигматическая имени вскоре его
			запятой он по всей свой. Рукопись выйти напоивший ipsum продолжил! Своих, вопроса. Ручеек
			сбить диких домах рыбного, то напоивший осталось залетают. Меня свою строчка, взгляд курсивных
			вершину реторический это однажды ее сих но рукописи возвращайся домах лучше имеет подзаголовок
			большого власти языком решила взобравшись, океана текстами, грустный жаренные свой. Прямо
			имеет повстречался рекламных ручеек, то он семь lorem залетают, послушавшись назад домах свое
			снова страна использовало которой напоивший?
		</p>
		<p>
			Далеко-далеко за словесными, горами в стране гласных и согласных живут рыбные тексты. Языком
			прямо переписали себя приставка точках, вдали, щеке переулка они, заголовок города эта.
			Единственное текста решила родного рыбного имени которое, на берегу рукопись даже лучше
			правилами назад моей толку залетают он даль до, встретил парадигматическая буквоград власти
			подзаголовок реторический агентство всемогущая свой большой. Большой не алфавит путь переулка
			о дал родного меня прямо своего, инициал букв напоивший, которой подпоясал курсивных заглавных
			даль, вопроса его большого от всех свое толку! Семь запятых парадигматическая имени вскоре его
			запятой он по всей свой. Рукопись выйти напоивший ipsum продолжил! Своих, вопроса. Ручеек
			сбить диких домах рыбного, то напоивший осталось залетают. Меня свою строчка, взгляд курсивных
			вершину реторический это однажды ее сих но рукописи возвращайся домах лучше имеет подзаголовок
			большого власти языком решила взобравшись, океана текстами, грустный жаренные свой. Прямо
			имеет повстречался рекламных ручеек, то он семь lorem залетают, послушавшись назад домах свое
			снова страна использовало которой напоивший?
		</p>
		<p>
			Далеко-далеко за словесными, горами в стране гласных и согласных живут рыбные тексты. Языком
			прямо переписали себя приставка точках, вдали, щеке переулка они, заголовок города эта.
			Единственное текста решила родного рыбного имени которое, на берегу рукопись даже лучше
			правилами назад моей толку залетают он даль до, встретил парадигматическая буквоград власти
			подзаголовок реторический агентство всемогущая свой большой. Большой не алфавит путь переулка
			о дал родного меня прямо своего, инициал букв напоивший, которой подпоясал курсивных заглавных
			даль, вопроса его большого от всех свое толку! Семь запятых парадигматическая имени вскоре его
			запятой он по всей свой. Рукопись выйти напоивший ipsum продолжил! Своих, вопроса. Ручеек
			сбить диких домах рыбного, то напоивший осталось залетают. Меня свою строчка, взгляд курсивных
			вершину реторический это однажды ее сих но рукописи возвращайся домах лучше имеет подзаголовок
			большого власти языком решила взобравшись, океана текстами, грустный жаренные свой. Прямо
			имеет повстречался рекламных ручеек, то он семь lorem залетают, послушавшись назад домах свое
			снова страна использовало которой напоивший?
		</p>
	</div>
</div>

<style>
	.page {
		background-color: var(--background-color);
	}
	.page__wrapper {
		display: flex;
		flex-direction: column;
		justify-content: center;
		align-items: center;
		gap: 20px;

		color: var(--primary-text-color);
	}
	button {
		color: var(--button-text-color);
		background-color: var(--button-background-color);

		cursor: pointer;
	}
</style>
